InformationRegisters/сабСоответствияОрганизацийПредприятиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>сабСоответствияОрганизацийПредприятиям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Д_ИсточникПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Д_ИсточникПП</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БанковскиеСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/сабСоответствияОрганизацийПредприятиям/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	СписокБанковскихСчетов.Отбор.Элементы.Очистить();
	
	Если Не Элементы.Список.ТекущиеДанные = Неопределено Тогда
		
		НовыйОтбор = СписокБанковскихСчетов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БанковскиеСчетаВладелец");
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.ПравоеЗначение = Элементы.Список.ТекущиеДанные.Организация;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыделенныеПредприятиемИОтветственным(Команда)
	ПодборОтветственного();
КонецПроцедуры

&НаКлиенте
Процедура ПодборОтветственного()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ФП = ПолучитьФорму("Справочник.Пользователи.Форма.УУ_ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	ФП.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Для каждого Строка Из Элементы.СписокБанковскихСчетов.ВыделенныеСтроки Цикл
		ИзменитьБанковскийСчет(Строка,ВыбранноеЗначение);
	КонецЦикла;
	
	СписокПриАктивизацииСтроки(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьБанковскийСчет(Строка,ВыбранноеЗначение)
	
	ВыдСтроки =  Новый Массив;
	
	Для Каждого текСтр Из Элементы.СписокБанковскихСчетов.ВыделенныеСтроки Цикл
		ВыдСтроки.Добавить(ТекСтр);
	КонецЦикла;
	
	Для Каждого ТекВыд Из ВыдСтроки Цикл
		
		Й = Элементы.СписокБанковскихСчетов.ДанныеСтроки(ТекВыд);
		
		ИзменитьРегистрНаСервере(Й.БанковскиеСчета,Элементы.Список.ТекущиеДанные.Предприятие,ВыбранноеЗначение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРегистрНаСервере(БанковскийСчет,Предприятие,Ответственный)
	
	Регистр = РегистрыСведений.Д_ИсточникПП.СоздатьНаборЗаписей();
	Регистр.Отбор.БанковскиеСчета.Установить(БанковскийСчет); 
	Регистр.Прочитать();
	
	Для Каждого стрНабора из Регистр Цикл
		стрНабора.Предприятие = Предприятие;
		стрНабора.ОтветственноеЛицо = Ответственный;
	КонецЦикла;
	
	Регистр.Записать();
	
КонецПроцедуры
